snlkuharlocal/src/Documents/ПеремещениеВЗонуХранения/ПеремещениеВЗонуХранения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПеремещениеВЗонуХранения</name>
  <registerRecords>AccumulationRegister.ОстаткиЗХ</registerRecords>
  <attributes>
    <name>ЗонаХранения</name>
    <type>
      <types>CatalogRef.ЗоныХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗонаХраненияПолучатель</name>
    <type>
      <types>CatalogRef.ЗоныХранения</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Короба</name>
    <attributes>
      <name>ШККоробки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерЛистаНабора</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>17</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерНакладной</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШКЛистаНабора</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШКПаллеты</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерКоробки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Накладная</name>
      <type>
        <types>DocumentRef</types>
      </type>
    </attributes>
    <attributes>
      <name>КоробовВНакладной</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоробокВНакладной</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/AccumulationRegisters/ОстаткиЗХ/ОстаткиЗХ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиЗХ</name>
  <resources>
    <name>КоличествоКоробок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>НомерЛистаНабора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерНакладной</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерКоробки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Накладная</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоступления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ШКЛистаНабора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ЗонаХранения</name>
    <type>
      <types>CatalogRef.ЗоныХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ШККоробки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ШКПаллеты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/Documents/ПеремещениеВЗонуХранения/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
	СписокШК=Короба.ВыгрузитьКолонку("ШККоробки");
	
	Запрос=новый запрос;  	
	Запрос.Текст="ВЫБРАТЬ
	|	ОстаткиЗХОстатки.ШККоробки как ШККоробки 
	|ИЗ
	|	РегистрНакопления.ОстаткиЗХ.Остатки(
	|			&Дата,
	|			ШККоробки В (&Шк)
	|				И ЗонаХранения = &ЗХ) КАК ОстаткиЗХОстатки
	|ГДЕ
	|	ОстаткиЗХОстатки.КоличествоКоробокОстаток > 0";				 
	Запрос.УстановитьПараметр("ШК",СписокШК);
	Запрос.УстановитьПараметр("Дата",Дата);
	запрос.УстановитьПараметр("ЗХ",ЗонаХранения);	
	ЕстьНаОстаткахТекЗХ=запрос.Выполнить().выгрузить().ВыгрузитьКолонку("ШККоробки");
	
	
	
	Запрос=новый запрос; 
	Запрос.Текст="ВЫБРАТЬ
	|	ОстаткиЗХОстатки.ШККоробки КАК ШККоробки,
	|	ОстаткиЗХОстатки.ЗонаХранения как ЗонаХранения
	|ИЗ
	|	РегистрНакопления.ОстаткиЗХ.Остатки(
	|			&Дата,
	|			ШККоробки В (&Шк)
	|				И (НЕ ШККоробки В (&ШкЕстьНаОстатках))) КАК ОстаткиЗХОстатки
	|ГДЕ
	|	ОстаткиЗХОстатки.КоличествоКоробокОстаток > 0";				 
	Запрос.УстановитьПараметр("ШК",СписокШК);
	Запрос.УстановитьПараметр("ШкЕстьНаОстатках",ЕстьНаОстаткахТекЗХ);	
	Запрос.УстановитьПараметр("Дата",Дата);
	ЕстьНаОстаткахГдеТоЕще=запрос.Выполнить().Выгрузить();
	
	
	
	Для Каждого ТекСтрокаКороба Из Короба Цикл
		ЕстьВтекущемЗх=ЕстьНаОстаткахТекЗХ.Найти(ТекСтрокаКороба.ШККоробки);
		если ЕстьВтекущемЗх<>Неопределено тогда
			Движение = Движения.ОстаткиЗХ.Добавить();
			ЗаполнитьЗначенияСвойств(движение,ТекСтрокаКороба);
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.ЗонаХранения = ЗонаХранения;
			Движение.КоличествоКоробок = 1;
		иначе
			ЕстьВДругихЗХ=ЕстьНаОстаткахГдеТоЕще.Найти(ТекСтрокаКороба.ШККоробки);
			если ЕстьВДругихЗХ<>Неопределено тогда
				Движение = Движения.ОстаткиЗХ.Добавить();
				ЗаполнитьЗначенияСвойств(движение,ТекСтрокаКороба);
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				Движение.Период = Дата;
				Движение.ЗонаХранения = ЕстьВДругихЗХ.ЗонаХранения;
				Движение.КоличествоКоробок = 1;
	        КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ТекСтрокаКороба Из Короба Цикл
		Движение = Движения.ОстаткиЗХ.Добавить();
		ЗаполнитьЗначенияСвойств(движение,ТекСтрокаКороба);
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.ЗонаХранения = ЗонаХраненияПолучатель;
		Движение.КоличествоКоробок = 1;	
	КонецЦикла;
	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	если не ЗначениеЗаполнено(ЗонаХранения) тогда
		#Если клиент тогда
			Сообщить("Заполните зону хранения");
		#КонецЕсли
		отказ=Истина;
	КонецЕсли;
	
	если не ЗначениеЗаполнено(ЗонаХраненияПолучатель) тогда
		#Если клиент тогда
			Сообщить("Заполните зону хранения получатель");
		#КонецЕсли
		отказ=Истина;
	КонецЕсли;
	
	
	
КонецПроцедуры
